
#Узнав, что ДНК не является случайной строкой, только что поступившие в Институт биоинформатики студенты группы информатиков предложили использовать алгоритм сжатия, 
#который сжимает повторяющиеся символы в строке.

#Кодирование осуществляется следующим образом:
#s = 'aaaabbсaa' преобразуется в 'a4b2с1a2', то есть группы одинаковых символов исходной строки заменяются на этот символ и 
#количество его повторений в этой позиции строки.

#Напишите программу, которая считывает строку, кодирует её предложенным алгоритмом и выводит закодированную последовательность 
#на стандартный вывод. Кодирование должно учитывать регистр символов.



c=input()
a=c+" "
b=len(a)
p=1

for i in range(b):
  if i<b-1:
    if a[i]==a[i+1]and  i+1<=b:
      p+=1
    else:
      print(a[i] + str(p), end=(''))
    if a[i] != a[i+1]:
      p=1
  else:
    print()
